/*
 * @Author: wuzhaoyi
 * @Email: wuzhaoyi@njsdata.com
 * @LastEditors: wangchengyuan
 * @Date: 2020-12-01 14:56:22
 * @LastEditTime: 2021-03-29 11:49:54
 * @Description: 请描述文件作用
 */
export const ErrorCode = {
  '10130001': '数据标准校验不通过',
  '10130002': '数据绑定映射配置有误',
  '10130003': '填报组件绑定的字段在数据库中不存在',
  '10130004': '找不到填报多选组件或子表组件绑定的外键',
  '10130005': '填报组件绑定的字段在数据库中不存在',
  '10130006': '组件绑定的字段有误',
  '10130007': '填报id不存在',
  '10130008': '视图id不存在',
  '10130009': '数据校验失败',
  '10130010': '不支持的资产类型',
  '10130011': '导出数据长度超过32767',
  '10130012': '找不到资产',
  '10130013': '导入数据的模板不符合要求',
  // '10130014': '',
  '10130015': '更新填报数据时，id不可为空',
  '10130016': '关联的填报不是同一个数据源',
  '10130017': '数据不可为null',
  '10130018': '多选组件传值有误',
  '10130021': '不满足要求的弹窗选择子表绑定的视图',
  '10130023': '查询不到表单创建人字段',
  '10130027': '无权访问数据',
  // license错误校验
  '100000008': '错误的lic文件',
  '100000009': '超过最大实例限制',
  '100000010': '无权限访问',
  '100000011': 'license已经到期',
  '100000012': 'mac地址错误',
  '100000013': '错误的lic类型',
  '100000007': 'saas模式不支持更新license,请联系管理员',
};
